## Staging: system_status_static_site
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 12 to add, 0 to change, 11 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                                  NAME                                                                   |
|--------|-----------------------------------------------------------------------------------------------------------------------------------------|
| delete | `aws_acm_certificate.system_status_static_site_root_certificate`                                                                        |
|        | `aws_acm_certificate_validation.system_status_static_site[0]`                                                                           |
|        | `aws_route53_record.system_status_static_site[0]`                                                                                       |
|        | `module.system_status_static_site[0].aws_cloudfront_distribution.simple_static_website`                                                 |
|        | `module.system_status_static_site[0].aws_cloudfront_origin_access_identity.simple_static_website`                                       |
|        | `module.system_status_static_site[0].aws_route53_record.cloudfront_alias`                                                               |
|        | `module.system_status_static_site[0].aws_s3_bucket.this`                                                                                |
|        | `module.system_status_static_site[0].aws_s3_bucket_policy.oai_policy`                                                                   |
|        | `module.system_status_static_site[0].aws_s3_bucket_public_access_block.this`                                                            |
|        | `module.system_status_static_site[0].aws_s3_bucket_website_configuration.this`                                                          |
|        | `module.system_status_static_site[0].random_string.suffix`                                                                              |
| add    | `module.system_status_static_site.aws_acm_certificate.cloudfront[0]`                                                                    |
|        | `module.system_status_static_site.aws_acm_certificate_validation.cloudfront[0]`                                                         |
|        | `module.system_status_static_site.aws_cloudfront_distribution.simple_static_website`                                                    |
|        | `module.system_status_static_site.aws_cloudfront_origin_access_identity.simple_static_website`                                          |
|        | `module.system_status_static_site.aws_route53_record.cloudfront_alias`                                                                  |
|        | `module.system_status_static_site.aws_route53_record.cloudfront_certificate_validation[&quot;*.status.staging.notification.cdssandbox.xyz&quot;]` |
|        | `module.system_status_static_site.aws_route53_record.cloudfront_certificate_validation[&quot;status.staging.notification.cdssandbox.xyz&quot;]`   |
|        | `module.system_status_static_site.aws_s3_bucket.this`                                                                                   |
|        | `module.system_status_static_site.aws_s3_bucket_policy.oai_policy`                                                                      |
|        | `module.system_status_static_site.aws_s3_bucket_public_access_block.this`                                                               |
|        | `module.system_status_static_site.aws_s3_bucket_website_configuration.this`                                                             |
|        | `module.system_status_static_site.random_string.suffix`                                                                                 |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # aws_acm_certificate.system_status_static_site_root_certificate will be destroyed
  # (because aws_acm_certificate.system_status_static_site_root_certificate is not in configuration)
  - resource "aws_acm_certificate" "system_status_static_site_root_certificate" {
      - arn                       = "arn:aws:acm:us-east-1:239043911459:certificate/833e9fa4-d404-4a08-9894-04d0d734d65f" -> null
      - domain_name               = "status.staging.notification.cdssandbox.xyz" -> null
      - domain_validation_options = [
          - {
              - domain_name           = "status.staging.notification.cdssandbox.xyz"
              - resource_record_name  = "_440d029c47fc1dfe910ea2610b495f24.status.staging.notification.cdssandbox.xyz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_2b263703fa6b736f742a52128f2261b7.mhbtsbpdnt.acm-validations.aws."
            },
        ] -> null
      - id                        = "arn:aws:acm:us-east-1:239043911459:certificate/833e9fa4-d404-4a08-9894-04d0d734d65f" -> null
      - key_algorithm             = "RSA_2048" -> null
      - not_after                 = "2025-07-09T23:59:59Z" -> null
      - not_before                = "2024-06-10T00:00:00Z" -> null
      - pending_renewal           = false -> null
      - renewal_eligibility       = "ELIGIBLE" -> null
      - renewal_summary           = [] -> null
      - status                    = "ISSUED" -> null
      - subject_alternative_names = [
          - "status.staging.notification.cdssandbox.xyz",
        ] -> null
      - tags                      = {
          - "CostCenter" = "notification-canada-ca-staging"
        } -> null
      - tags_all                  = {
          - "CostCenter" = "notification-canada-ca-staging"
        } -> null
      - type                      = "AMAZON_ISSUED" -> null
      - validation_emails         = [] -> null
      - validation_method         = "DNS" -> null

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # aws_acm_certificate_validation.system_status_static_site[0] will be destroyed
  # (because aws_acm_certificate_validation.system_status_static_site is not in configuration)
  - resource "aws_acm_certificate_validation" "system_status_static_site" {
      - certificate_arn         = "arn:aws:acm:us-east-1:239043911459:certificate/833e9fa4-d404-4a08-9894-04d0d734d65f" -> null
      - id                      = "2024-06-10 19:28:29.754 +0000 UTC" -> null
      - validation_record_fqdns = [
          - "_440d029c47fc1dfe910ea2610b495f24.status.staging.notification.cdssandbox.xyz",
        ] -> null
    }

  # aws_route53_record.system_status_static_site[0] will be destroyed
  # (because aws_route53_record.system_status_static_site is not in configuration)
  - resource "aws_route53_record" "system_status_static_site" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_440d029c47fc1dfe910ea2610b495f24.status.staging.notification.cdssandbox.xyz" -> null
      - id                               = "Z04028033PLSHVOO9ZJ1Z__440d029c47fc1dfe910ea2610b495f24.status.staging.notification.cdssandbox.xyz._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_440d029c47fc1dfe910ea2610b495f24.status.staging.notification.cdssandbox.xyz" -> null
      - records                          = [
          - "_2b263703fa6b736f742a52128f2261b7.mhbtsbpdnt.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> null
    }

  # module.system_status_static_site.data.aws_iam_policy_document.s3_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.system_status_static_site.aws_acm_certificate.cloudfront[0] will be created
  + resource "aws_acm_certificate" "cloudfront" {
      + arn                       = (known after apply)
      + domain_name               = "status.staging.notification.cdssandbox.xyz"
      + domain_validation_options = [
          + {
              + domain_name           = "*.status.staging.notification.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "status.staging.notification.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.status.staging.notification.cdssandbox.xyz",
          + "status.staging.notification.cdssandbox.xyz",
        ]
      + tags                      = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tags_all                  = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.system_status_static_site.aws_acm_certificate_validation.cloudfront[0] will be created
  + resource "aws_acm_certificate_validation" "cloudfront" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.system_status_static_site.aws_cloudfront_distribution.simple_static_website will be created
  + resource "aws_cloudfront_distribution" "simple_static_website" {
      + aliases                         = [
          + "status.staging.notification.cdssandbox.xyz",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = false
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_100"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags                            = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tags_all                        = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = 86400
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = "simple_static_website"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = true
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = (known after apply)
          + origin_id           = "simple_static_website"

          + s3_origin_config {
              + origin_access_identity = (known after apply)
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = (known after apply)
          + minimum_protocol_version = "TLSv1.2_2021"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.system_status_static_site.aws_cloudfront_origin_access_identity.simple_static_website will be created
  + resource "aws_cloudfront_origin_access_identity" "simple_static_website" {
      + caller_reference                = (known after apply)
      + cloudfront_access_identity_path = (known after apply)
      + comment                         = "Allow CloudFront to reach the S3 bucket for domain status.staging.notification.cdssandbox.xyz"
      + etag                            = (known after apply)
      + iam_arn                         = (known after apply)
      + id                              = (known after apply)
      + s3_canonical_user_id            = (known after apply)
    }

  # module.system_status_static_site.aws_route53_record.cloudfront_alias will be created
  + resource "aws_route53_record" "cloudfront_alias" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "status.staging.notification.cdssandbox.xyz"
      + type            = "A"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.system_status_static_site.aws_route53_record.cloudfront_certificate_validation["*.status.staging.notification.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "cloudfront_certificate_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # module.system_status_static_site.aws_route53_record.cloudfront_certificate_validation["status.staging.notification.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "cloudfront_certificate_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # module.system_status_static_site.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "notification-canada-ca-staging-system-status"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.system_status_static_site.aws_s3_bucket_policy.oai_policy will be created
  + resource "aws_s3_bucket_policy" "oai_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.system_status_static_site.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.system_status_static_site.aws_s3_bucket_website_configuration.this will be created
  + resource "aws_s3_bucket_website_configuration" "this" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + error_document {
          + key = "error.html"
        }

      + index_document {
          + suffix = "index.html"
        }
    }

  # module.system_status_static_site.random_string.suffix will be created
  + resource "random_string" "suffix" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.system_status_static_site[0].aws_cloudfront_distribution.simple_static_website will be destroyed
  # (because module.system_status_static_site[0] is not in configuration)
  - resource "aws_cloudfront_distribution" "simple_static_website" {
      - aliases                        = [
          - "status.staging.notification.cdssandbox.xyz",
        ] -> null
      - arn                            = "arn:aws:cloudfront::239043911459:distribution/E2RSDJXY49J0DP" -> null
      - caller_reference               = "terraform-20240610194952148900000002" -> null
      - default_root_object            = "index.html" -> null
      - domain_name                    = "dqr69nc0xdw37.cloudfront.net" -> null
      - enabled                        = true -> null
      - etag                           = "E2GZ8ZPB256L0I" -> null
      - hosted_zone_id                 = "Z2FDTNDATAQYW2" -> null
      - http_version                   = "http2" -> null
      - id                             = "E2RSDJXY49J0DP" -> null
      - in_progress_validation_batches = 0 -> null
      - is_ipv6_enabled                = false -> null
      - last_modified_time             = "2024-06-10 19:49:52.247 +0000 UTC" -> null
      - price_class                    = "PriceClass_100" -> null
      - retain_on_delete               = false -> null
      - staging                        = false -> null
      - status                         = "Deployed" -> null
      - tags                           = {
          - "CostCentre" = "notification-canada-ca-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all                       = {
          - "CostCentre" = "notification-canada-ca-staging"
          - "Terraform"  = "true"
        } -> null
      - trusted_key_groups             = [
          - {
              - enabled = false
              - items   = []
            },
        ] -> null
      - trusted_signers                = [
          - {
              - enabled = false
              - items   = []
            },
        ] -> null
      - wait_for_deployment            = true -> null

      - default_cache_behavior {
          - allowed_methods        = [
              - "DELETE",
              - "GET",
              - "HEAD",
              - "OPTIONS",
              - "PATCH",
              - "POST",
              - "PUT",
            ] -> null
          - cached_methods         = [
              - "GET",
              - "HEAD",
            ] -> null
          - compress               = true -> null
          - default_ttl            = 86400 -> null
          - max_ttl                = 86400 -> null
          - min_ttl                = 0 -> null
          - smooth_streaming       = false -> null
          - target_origin_id       = "simple_static_website" -> null
          - trusted_key_groups     = [] -> null
          - trusted_signers        = [] -> null
          - viewer_protocol_policy = "redirect-to-https" -> null

          - forwarded_values {
              - headers                 = [] -> null
              - query_string            = true -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "none" -> null
                  - whitelisted_names = [] -> null
                }
            }
        }

      - origin {
          - connection_attempts = 3 -> null
          - connection_timeout  = 10 -> null
          - domain_name         = "notification-canada-ca-staging-system-status.s3.ca-central-1.amazonaws.com" -> null
          - origin_id           = "simple_static_website" -> null

          - s3_origin_config {
              - origin_access_identity = "origin-access-identity/cloudfront/ETMW8R4BZE7I3" -> null
            }
        }

      - restrictions {
          - geo_restriction {
              - locations        = [] -> null
              - restriction_type = "none" -> null
            }
        }

      - viewer_certificate {
          - acm_certificate_arn            = "arn:aws:acm:us-east-1:239043911459:certificate/833e9fa4-d404-4a08-9894-04d0d734d65f" -> null
          - cloudfront_default_certificate = false -> null
          - minimum_protocol_version       = "TLSv1.2_2021" -> null
          - ssl_support_method             = "sni-only" -> null
        }
    }

  # module.system_status_static_site[0].aws_cloudfront_origin_access_identity.simple_static_website will be destroyed
  # (because module.system_status_static_site[0] is not in configuration)
  - resource "aws_cloudfront_origin_access_identity" "simple_static_website" {
      - caller_reference                = "terraform-20240610194950245400000001" -> null
      - cloudfront_access_identity_path = "origin-access-identity/cloudfront/ETMW8R4BZE7I3" -> null
      - comment                         = "Allow CloudFront to reach the S3 bucket for domain status.staging.notification.cdssandbox.xyz" -> null
      - etag                            = "E22LP8069D610A" -> null
      - iam_arn                         = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity ETMW8R4BZE7I3" -> null
      - id                              = "ETMW8R4BZE7I3" -> null
      - s3_canonical_user_id            = "ad690ef0eedbae9d89c5bfba4dfd26b8059d1ad1ae28751e868e07705c0ef42014d6cc9a1b284eac466213b4bad95b1d" -> null
    }

  # module.system_status_static_site[0].aws_route53_record.cloudfront_alias will be destroyed
  # (because module.system_status_static_site[0] is not in configuration)
  - resource "aws_route53_record" "cloudfront_alias" {
      - fqdn                             = "status.staging.notification.cdssandbox.xyz" -> null
      - id                               = "Z04028033PLSHVOO9ZJ1Z_status.staging.notification.cdssandbox.xyz_A" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "status.staging.notification.cdssandbox.xyz" -> null
      - records                          = [] -> null
      - ttl                              = 0 -> null
      - type                             = "A" -> null
      - zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> null

      - alias {
          - evaluate_target_health = false -> null
          - name                   = "dqr69nc0xdw37.cloudfront.net" -> null
          - zone_id                = "Z2FDTNDATAQYW2" -> null
        }
    }

  # module.system_status_static_site[0].aws_s3_bucket.this will be destroyed
  # (because module.system_status_static_site[0] is not in configuration)
  - resource "aws_s3_bucket" "this" {
      - arn                         = "arn:aws:s3:::notification-canada-ca-staging-system-status" -> null
      - bucket                      = "notification-canada-ca-staging-system-status" -> null
      - bucket_domain_name          = "notification-canada-ca-staging-system-status.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "notification-canada-ca-staging-system-status.s3.ca-central-1.amazonaws.com" -> null
      - force_destroy               = true -> null
      - hosted_zone_id              = "Z1QDHH18159H29" -> null
      - id                          = "notification-canada-ca-staging-system-status" -> null
      - object_lock_enabled         = false -> null
      - policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity ETMW8R4BZE7I3"
                        }
                      - Resource  = "arn:aws:s3:::notification-canada-ca-staging-system-status/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - region                      = "ca-central-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null
      - website_domain              = "s3-website.ca-central-1.amazonaws.com" -> null
      - website_endpoint            = "notification-canada-ca-staging-system-status.s3-website.ca-central-1.amazonaws.com" -> null

      - grant {
          - id          = "69e55cefe4e71d4930761796ca1b0184cad872eb794dd25fbfc366b4501a75f9" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      - website {
          - error_document = "error.html" -> null
          - index_document = "index.html" -> null
        }
    }

  # module.system_status_static_site[0].aws_s3_bucket_policy.oai_policy will be destroyed
  # (because module.system_status_static_site[0] is not in configuration)
  - resource "aws_s3_bucket_policy" "oai_policy" {
      - bucket = "notification-canada-ca-staging-system-status" -> null
      - id     = "notification-canada-ca-staging-system-status" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity ETMW8R4BZE7I3"
                        }
                      - Resource  = "arn:aws:s3:::notification-canada-ca-staging-system-status/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
    }

  # module.system_status_static_site[0].aws_s3_bucket_public_access_block.this will be destroyed
  # (because module.system_status_static_site[0] is not in configuration)
  - resource "aws_s3_bucket_public_access_block" "this" {
      - block_public_acls       = true -> null
      - block_public_policy     = true -> null
      - bucket                  = "notification-canada-ca-staging-system-status" -> null
      - id                      = "notification-canada-ca-staging-system-status" -> null
      - ignore_public_acls      = true -> null
      - restrict_public_buckets = true -> null
    }

  # module.system_status_static_site[0].aws_s3_bucket_website_configuration.this will be destroyed
  # (because module.system_status_static_site[0] is not in configuration)
  - resource "aws_s3_bucket_website_configuration" "this" {
      - bucket           = "notification-canada-ca-staging-system-status" -> null
      - id               = "notification-canada-ca-staging-system-status" -> null
      - website_domain   = "s3-website.ca-central-1.amazonaws.com" -> null
      - website_endpoint = "notification-canada-ca-staging-system-status.s3-website.ca-central-1.amazonaws.com" -> null

      - error_document {
          - key = "error.html" -> null
        }

      - index_document {
          - suffix = "index.html" -> null
        }
    }

  # module.system_status_static_site[0].random_string.suffix will be destroyed
  # (because module.system_status_static_site[0] is not in configuration)
  - resource "random_string" "suffix" {
      - id          = "0yernazl" -> null
      - length      = 8 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "0yernazl" -> null
      - special     = false -> null
      - upper       = false -> null
    }

Plan: 12 to add, 0 to change, 11 to destroy.

Changes to Outputs:
  ~ system_status_static_site_bucket_id     = "notification-canada-ca-staging-system-status" -> (known after apply)
  ~ system_status_static_site_bucket_name   = "arn:aws:s3:::notification-canada-ca-staging-system-status" -> (known after apply)
  ~ system_status_static_site_bucket_region = "ca-central-1" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

